performance_tests/config/testConfig.yml
execution:
- concurrency: 20
  ramp-up: 1m
  hold-for: 2m
  scenario: acc-performance-test

scenarios:
  acc-performance-test:
    requests:
    - envURL

reporting:
- module: console
- module: passfail
  criteria:
  - avg-rt of IndexPage>150ms for 10s, stop as failed
  - fail of CheckoutPage>50% for 10s, stop as failed
- module: final-stats
  summary: true
  percentiles: true
  failed-labels: false
  test-duration: true
- module: junit-xml
  data-source: pass-fail
  filename: TaurusResult/junit-result.xml